БухЭксп/Reports/CW_АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АктСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияИмяАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Reports/CW_АктСверкиВзаиморасчетов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент",Отчет.Контрагент);
	Параметры.Свойство("Договор",Отчет.Договор);
	Параметры.Свойство("НачалоПериода",Отчет.НачалоПериода);
	Параметры.Свойство("КонецПериода",Отчет.КонецПериода);
	
	Если ЗначениеЗаполнено(Отчет.Контрагент) И ЗначениеЗаполнено(Отчет.Договор) Тогда
		СформироватьПриОткрытии = Истина;
	КонецЕсли; 
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.НастройкиОтчета.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = '20120101';
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = ТекущаяДата();	
	КонецЕсли; 
	
	Если СформироватьПриОткрытии Тогда
		СкрытьНастройки();
		СформироватьОтчет_Сервер();
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастройкиОтчета(Команда)
	
	Если Элементы.НастройкиОтчета.Пометка Тогда
		СкрытьНастройки();
	Иначе
		ПоказатьНастройки();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = Ложь;
	Элементы.НастройкиОтчета.Пометка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = Истина;
	Элементы.НастройкиОтчета.Пометка = Истина;
	
КонецПроцедуры
	
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыбПериодНажатие(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Отчет.НачалоПериода;
	Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	
	Если ОтветПериод <> Неопределено Тогда
		Отчет.НачалоПериода = НачалоДня(ОтветПериод.ДатаНачала);
		Отчет.КонецПериода  = КонецДня(ОтветПериод.ДатаОкончания);
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Отчет.Контрагент) Тогда
		_УФК.ВывестиПредупреждение("Выберите контрагента!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.Договор) Тогда
		_УФК.ВывестиПредупреждение("Выберите договор!");
		Возврат;
	КонецЕсли;
	
	СкрытьНастройки(); 
	
	СформироватьОтчет_Сервер(); 
	
	ПодписьИПечатьПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет_Сервер()
	
	//Подпись и печать 
	УстановитьАдресПодписиИПечатиНаСервере();
	//Подпись и печать 
	
	ЭтаФорма.Результат.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат);
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Акт сверки взаиморасчетов");
	//УправлениеКолонтитулами
	
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	//Подсистема.УчетПриложенийДоговоров
	Отчет.ПриложениеКДоговору = Неопределено;
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()

	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПараметрФункциональнойОпции(ЭтаФорма, Отчет);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры


//Подпись и печать 
&НаСервере
Процедура УстановитьАдресПодписиИПечатиНаСервере()
	
	ДатаСреза 	= Отчет.КонецПериода;
	
	ДоговорКлиента  = Отчет.Договор; 
	Организация		= Отчет.Договор.Организация; 
	
	Если ЗначениеЗаполнено(Отчет.ПриложениеКДоговору) Тогда
		ДоговорКлиента 	=  Отчет.ПриложениеКДоговору;   
		Организация		= Отчет.ПриложениеКДоговору.Договор.Организация;
	КонецЕсли;
	//Подпись руководителя     

	
	РуководительОрганизации = CW_Настройки.ПолучитьЗначениеПараметраДоговора(ДатаСреза, ДоговорКлиента, "РуководительОрганизации");  
	Если ЗначениеЗаполнено(РуководительОрганизации) Тогда  
		
		ПодписьДвоичныеДанные = CW_Печать.ПолучитьПодписьСотрудника(РуководительОрганизации, Ложь);
		Если ТипЗнч(ПодписьДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			АдресПодписи = ПоместитьВоВременноеХранилище(ПодписьДвоичныеДанные, УникальныйИдентификатор);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ПараметрыСотрудников.Сотрудник КАК Сотрудник,
		|	CW_ПараметрыСотрудников.Подпись КАК Подпись
		|ИЗ
		|	РегистрСведений.CW_ПараметрыСотрудников КАК CW_ПараметрыСотрудников
		|ГДЕ
		|	CW_ПараметрыСотрудников.Сотрудник = &РуководительОрганизации";
		
		Запрос.УстановитьПараметр("РуководительОрганизации", РуководительОрганизации);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ПодписьДвоичныеДанные = Выборка.Подпись.Получить();
		КонецЕсли;
	КонецЕсли;
	//Подпись руководителя     
	
	//Печать организации 
	ПечатьДвоичныеДанные = CW_Печать.ПолучитьПечатьОрганизации(Организация,,ДатаСреза, Ложь);  
	Если ТипЗнч(ПечатьДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		АдресПечати = ПоместитьВоВременноеХранилище(ПечатьДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
	//Печать организации
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьИПечатьПриИзменении(Элемент)

	ПодписьИПечатьПриИзмененииНаКлиенте();

КонецПроцедуры  

&НаКлиенте
Процедура ПодписьИПечатьПриИзмененииНаКлиенте()  
	
	Постфикс = ПолучитьПостфиксПодписиИПечати(Отчет.Договор);
	
	Если Постфикс = Неопределено Тогда
		Для Каждого КартинкаМакета из Результат.Рисунки Цикл
			КартинкаМакета.ВыводитьНаПечать = Ложь;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если Результат.Рисунки.Количество() > 0 Тогда  
		Для Каждого КартинкаМакета из Результат.Рисунки Цикл
			
			Картинка  = Новый Картинка;
			Если ПодписьИПечать Тогда 
				ДвоичныеДанные = Неопределено;
				
				Если СтрНачинаетсяС(КартинкаМакета.Имя, "ПечатьОрганизации") Тогда  
					Если ЭтоАдресВременногоХранилища(АдресПечати) Тогда  
						Если СтрЗаканчиваетсяНа(КартинкаМакета.Имя, Постфикс) Тогда
							ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресПечати);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;   
				
				Если СтрНачинаетсяС(КартинкаМакета.Имя, "ПодписьРуководителя") Тогда
					Если ЭтоАдресВременногоХранилища(АдресПодписи) Тогда    
						Если СтрЗаканчиваетсяНа(КартинкаМакета.Имя, Постфикс) Тогда
							ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресПодписи);
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли; 
				
				Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
					Картинка = новый Картинка(ДвоичныеДанные);   
				КонецЕсли;
			КонецЕсли;
			
			КартинкаМакета.ВыводитьНаПечать = ПодписьИПечать;
			КартинкаМакета.ГраницаСверху = Ложь;
			КартинкаМакета.ГраницаСлева  = Ложь;
			КартинкаМакета.ГраницаСнизу  = Ложь;
			КартинкаМакета.ГраницаСправа = Ложь;  
			
			КартинкаМакета.Картинка = Картинка;  
			
			
		КонецЦикла 
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьПостфиксПодписиИПечати(Договор)
	
	Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
		Возврат "Исполнителя";
	КонецЕсли;
	
	Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
		Возврат "Заказчика";
	КонецЕсли;
	
КонецФункции

//Подпись и печать


// ----------------------------------------------------------------------------
